MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX575F256H.atdf
         <register caption="CAN Filter Control Register 7" name="C1FLTCON7" offset="0x130" rw="RW" size="4">
            <bitfield caption="FIFO Selection bits" mask="0x0000001F" name="FSEL28" values="C1FLTCON7__FSEL28" />
            <bitfield caption="Filter 28 Mask Select bits" mask="0x00000060" name="MSEL28" values="C1FLTCON7__MSEL28" />
            <bitfield caption="Filter 28 Enable bit" mask="0x00000080" name="FLTEN28" values="C1FLTCON7__FLTEN28" />
            <bitfield caption="FIFO Selection bits" mask="0x00001F00" name="FSEL29" values="C1FLTCON7__FSEL29" />
            <bitfield caption="Filter 29 Mask Select bits" mask="0x00006000" name="MSEL29" values="C1FLTCON7__MSEL29" />
            <bitfield caption="Filter 29 Enable bit" mask="0x00008000" name="FLTEN29" values="C1FLTCON7__FLTEN29" />
            <bitfield caption="FIFO Selection bits" mask="0x001F0000" name="FSEL30" values="C1FLTCON7__FSEL30" />
            <bitfield caption="Filter 30Mask Select bits" mask="0x00600000" name="MSEL30" values="C1FLTCON7__MSEL30" />
            <bitfield caption="Filter 30Enable bit" mask="0x00800000" name="FLTEN30" values="C1FLTCON7__FLTEN30" />
            <bitfield caption="FIFO Selection bits" mask="0x1F000000" name="FSEL31" values="C1FLTCON7__FSEL31" />
            <bitfield caption="Filter 31 Mask Select bits" mask="0x60000000" name="MSEL31" values="C1FLTCON7__MSEL31" />
            <bitfield caption="Filter 31 Enable bit" mask="0x80000000" name="FLTEN31" values="C1FLTCON7__FLTEN31" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF0" offset="0x140" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF0__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF0__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF0__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF1" offset="0x150" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF1__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF1__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF1__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF2" offset="0x160" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF2__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF2__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF2__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF3" offset="0x170" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF3__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF3__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF3__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF4" offset="0x180" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF4__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF4__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF4__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF5" offset="0x190" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF5__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF5__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF5__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF6" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF6__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF6__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF6__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF7" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF7__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF7__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF7__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF8" offset="0x1c0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF8__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF8__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF8__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF9" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF9__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF9__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF9__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF10" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF10__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF10__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF10__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF11" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF11__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF11__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF11__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF12" offset="0x200" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF12__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF12__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF12__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF13" offset="0x210" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF13__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF13__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF13__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF14" offset="0x220" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF14__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF14__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF14__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF15" offset="0x230" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF15__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF15__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF15__SID" />
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF16" offset="0x240" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF16__EID" />
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF16__EXID" />
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF16__SID" />
         </register>
